results-n1-standard-8-60-second-tests/0800-cache-summary.txt

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: -
     script: har-test-script.js

    duration: -, iterations: -
         vus: 1, max: 800

    init [----------------------------------------------------------] starting
    █ page_1 - https://test.devopsdirective.com/posts/2020/03/always-on-minikube/

      ✓ http2 is used
      ✓ status is 200
      ✓ content is present

    check_failure_rate.........: 0.00%   ✓ 0      ✗ 51566
    checks.....................: 100.00% ✓ 154711 ✗ 0    
    data_received..............: 25 GB   412 MB/s
    data_sent..................: 64 MB   1.1 MB/s
    group_duration.............: avg=366.63ms min=143.12ms med=334.49ms max=1.52s    p(90)=597.48ms p(95)=698.78ms
    http_req_blocked...........: avg=101.67µs min=133ns    med=304ns    max=330.89ms p(90)=504ns    p(95)=546ns   
    http_req_connecting........: avg=64.68µs  min=0s       med=0s       max=288.42ms p(90)=0s       p(95)=0s      
    http_req_duration..........: avg=82.1ms   min=11.36ms  med=67.01ms  max=1.08s    p(90)=154.15ms p(95)=203.15ms
    http_req_receiving.........: avg=16.98ms  min=39µs     med=10.41ms  max=765.53ms p(90)=44.73ms  p(95)=65.88ms 
    http_req_sending...........: avg=44.52µs  min=10.74µs  med=37.13µs  max=134.33ms p(90)=55.84µs  p(95)=63.66µs 
    http_req_tls_handshaking...: avg=36.35µs  min=0s       med=0s       max=173.63ms p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=65.07ms  min=10.54ms  med=51.28ms  max=1.08s    p(90)=117.84ms p(95)=164.58ms
    http_reqs..................: 620588  10340.534545/s
    iteration_duration.........: avg=372.09ms min=143.14ms med=337.31ms max=1.58s    p(90)=611.07ms p(95)=715.21ms
    iterations.................: 51352   855.651624/s
    vus........................: 798     min=14   max=798
    vus_max....................: 800     min=800  max=800