results-n1-standard-8-60-second-tests/1600-cache-summary.txt

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: -
     script: har-test-script.js

    duration: -, iterations: -
         vus: 1, max: 1600

    init [----------------------------------------------------------] starting
    █ page_1 - https://test.devopsdirective.com/posts/2020/03/always-on-minikube/

      ✓ http2 is used
      ✓ status is 200
      ✓ content is present

    check_failure_rate.........: 0.00%   ✓ 0      ✗ 44186 
    checks.....................: 100.00% ✓ 133122 ✗ 0     
    data_received..............: 21 GB   354 MB/s
    data_sent..................: 58 MB   956 kB/s
    group_duration.............: avg=787.86ms min=146.24ms med=662.57ms max=3.11s    p(90)=1.52s    p(95)=1.8s    
    http_req_blocked...........: avg=404.62µs min=129ns    med=293ns    max=1.1s     p(90)=500ns    p(95)=542ns   
    http_req_connecting........: avg=259.91µs min=0s       med=0s       max=1.06s    p(90)=0s       p(95)=0s      
    http_req_duration..........: avg=152.52ms min=11.52ms  med=111.95ms max=1.83s    p(90)=309.18ms p(95)=415.36ms
    http_req_receiving.........: avg=30ms     min=36.38µs  med=13.39ms  max=1.8s     p(90)=77.36ms  p(95)=124.43ms
    http_req_sending...........: avg=50.14µs  min=10.76µs  med=37.71µs  max=421.24ms p(90)=58.4µs   p(95)=67.92µs 
    http_req_tls_handshaking...: avg=143.02µs min=0s       med=0s       max=600.47ms p(90)=0s       p(95)=0s      
    http_req_waiting...........: avg=122.47ms min=0s       med=84.36ms  max=1.49s    p(90)=255.85ms p(95)=357.39ms
    http_reqs..................: 541371  9003.436614/s
    iteration_duration.........: avg=818.87ms min=146.27ms med=693.89ms max=3.53s    p(90)=1.57s    p(95)=1.85s   
    iterations.................: 44126   733.850989/s
    vus........................: 1599    min=27   max=1599
    vus_max....................: 1600    min=1600 max=1600